glory666g/glory/nRF5_SDK_17.1.0_ddde560/examples/ble_peripheral/ble_app_uart/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}
//SAADC代码
#define SAMPLES_IN_BUFFER 1
static nrf_saadc_value_t m_buffer_pool[2][SAMPLES_IN_BUFFER];//初始化缓冲区

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
	if(p_event->type == NRF_DRV_SAADC_EVT_DONE)
	{
		ret_code_t err_code;
		int16_t adc_value;
		uint16_t battery_voltage;
		uint8_t battery_level;
		
		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer,SAMPLES_IN_BUFFER);
		APP_ERROR_CHECK(err_code);
		adc_value = p_event->data.done.p_buffer[0];
		//将电压转化成电池电量
		battery_voltage = (adc_value*3.6/1024)*1000;
		battery_level = battery_level_in_percent(battery_voltage);
		//上报主机
		err_code = ble_bas_battery_level_update(&m_bas,battery_level,BLE_CONN_HANDLE_ALL);
		if((err_code!=NRF_SUCCESS)&&(err_code!=NRF_ERROR_INVALID_STATE)&&(err_code!=NRF_ERROR_RESOURCES)&&
			(err_code!=NRF_ERROR_BUSY)&&(err_code!=BLE_ERROR_GATTS_SYS_ATTR_MISSING))
		{
			APP_ERROR_HANDLER(err_code);
		}
	}
	
}



static void saadc_init(void)
{
	ret_code_t err_code;
	//将ADC引脚设置为VDD引脚
	nrf_saadc_channel_config_t channel_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_VDD);
	
	err_code = nrf_drv_saadc_init(NULL,saadc_callback);
	
	APP_ERROR_CHECK(err_code);
	//SAADC通道初始化，配置前面的参数
	err_code=nrf_drv_saadc_channel_init(0,&channel_config);
	APP_ERROR_CHECK(err_code);
	
	//配置缓冲区buffer1
	err_code=nrf_drv_saadc_buffer_convert(m_buffer_pool[0],SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
	
	//配置缓冲区buffer2
	err_code=nrf_drv_saadc_buffer_convert(m_buffer_pool[1],SAMPLES_IN_BUFFER);
	APP_ERROR_CHECK(err_code);
}




/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

		saadc_init();//ADC初始化
	
    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
